MOVE ZERO TO WS-COUNTER. 
PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 100 
 ADD 1 TO WS-SUM(WS-COUNTER) 
END-PERFORM. 
DISPLAY "The sum is: ", WS-SUM(100). 
01 WS-SUM PIC 9(5) OCCURS 100 TIMES.